note/drawio/converted/dot/260420-timepiecer-datapath.dot
digraph G {
  graph [rankdir=LR];
  node [shape=box, style="rounded,filled", fillcolor="#f8f9fb", color="#5b6b7a", fontname="Arial"];
  "n_E9N4p9MdtPNkOz_vh_yI_1" [label="node_h_yI-1"];
  "n_Xt5h5PVO_5MyDHxTXsWM_1" [label="node_XsWM-1"];
  "n_Xt5h5PVO_5MyDHxTXsWM_10" [label="6"];
  "n_Xt5h5PVO_5MyDHxTXsWM_11" [label="sec_tick_count"];
  "n_Xt5h5PVO_5MyDHxTXsWM_13" [label="o_sec_tick"];
  "n_Xt5h5PVO_5MyDHxTXsWM_14" [label="i_tick"];
  "n_Xt5h5PVO_5MyDHxTXsWM_18" [label="min_tick_count"];
  "n_Xt5h5PVO_5MyDHxTXsWM_2" [label="timepiecer_datapath"];
  "n_Xt5h5PVO_5MyDHxTXsWM_20" [label="5"];
  "n_Xt5h5PVO_5MyDHxTXsWM_21" [label="hour_tick_count"];
  "n_Xt5h5PVO_5MyDHxTXsWM_22" [label="o_hour_tick"];
  "n_Xt5h5PVO_5MyDHxTXsWM_23" [label="i_tick"];
  "n_Xt5h5PVO_5MyDHxTXsWM_24" [label="o_min_tick"];
  "n_Xt5h5PVO_5MyDHxTXsWM_25" [label="i_tick"];
  "n_Xt5h5PVO_5MyDHxTXsWM_27" [label="i_set_index"];
  "n_Xt5h5PVO_5MyDHxTXsWM_29" [label="i_set_mode"];
  "n_Xt5h5PVO_5MyDHxTXsWM_31" [label="i_index_shift"];
  "n_Xt5h5PVO_5MyDHxTXsWM_33" [label="i_decrement"];
  "n_Xt5h5PVO_5MyDHxTXsWM_38" [label="time_set_module"];
  "n_Xt5h5PVO_5MyDHxTXsWM_4" [label="100Hz tick"];
  "n_Xt5h5PVO_5MyDHxTXsWM_40" [label="i_increment"];
  "n_Xt5h5PVO_5MyDHxTXsWM_42" [label="24"];
  "n_Xt5h5PVO_5MyDHxTXsWM_44" [label="w_set_msec"];
  "n_Xt5h5PVO_5MyDHxTXsWM_46" [label="w_set_sec"];
  "n_Xt5h5PVO_5MyDHxTXsWM_48" [label="w_set_min"];
  "n_Xt5h5PVO_5MyDHxTXsWM_5" [label="tick_gen _100hz"];
  "n_Xt5h5PVO_5MyDHxTXsWM_50" [label="w_set_hour"];
  "n_Xt5h5PVO_5MyDHxTXsWM_55" [label="w_set_mode"];
  "n_Xt5h5PVO_5MyDHxTXsWM_56" [label="w_timepiiecer_value"];
  "n_Xt5h5PVO_5MyDHxTXsWM_58" [label="24"];
  "n_Xt5h5PVO_5MyDHxTXsWM_59" [label="o_timepiecer_value"];
  "n_Xt5h5PVO_5MyDHxTXsWM_61" [label="i_decrement_1s"];
  "n_Xt5h5PVO_5MyDHxTXsWM_63" [label="i_increment_1s"];
  "n_Xt5h5PVO_5MyDHxTXsWM_67" [label="clk"];
  "n_Xt5h5PVO_5MyDHxTXsWM_7" [label="7"];
  "n_Xt5h5PVO_5MyDHxTXsWM_71" [label="rst"];
  "n_Xt5h5PVO_5MyDHxTXsWM_8" [label="msec_tick_count"];
  "n_Xt5h5PVO_5MyDHxTXsWM_8" -> "n_Xt5h5PVO_5MyDHxTXsWM_11";
  "n_Xt5h5PVO_5MyDHxTXsWM_11" -> "n_Xt5h5PVO_5MyDHxTXsWM_18";
  "n_Xt5h5PVO_5MyDHxTXsWM_18" -> "n_Xt5h5PVO_5MyDHxTXsWM_21";
}
